Documents/ЗаявкаНаОбучениеРазвитие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаявкаНаОбучениеРазвитие</Name>
			<BasedOn>
				<xr:Item>Catalog.МероприятияОбученияРазвития</xr:Item>
				<xr:Item>Document.ЗаявкаНаВключениеВПланОбучения</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьМероприятия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаСуммыРасходовНаПерсонал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиПерсонала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКомпетенции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компетенция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КомпетенцииПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапланированоОбучение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаОбучениеРазвитие/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСуммуРасходов();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Статус = Перечисления.СостоянияСогласования.Отклонено Тогда
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаНачала, "Объект.ДатаНачала", Отказ, НСтр("ru='Дата начала'"), , , Ложь);
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ДатаНачала > ДатаОкончания Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru ='Неверно заполнен период заявки'"), ЭтотОбъект, "ДатаНачала",, Отказ);
		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачала");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончания");
	КонецЕсли;
	
	ОбучениеРазвитие.ПроверитьТабличнуюЧастьСотрудниковНаДублиФизическихЛиц(ЭтотОбъект, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьПоМероприятиюОбучения(ДанныеЗаполнения);
	ЗаполнитьПоЗаявкеНаВключениеВПланОбучения(ДанныеЗаполнения);
	ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Статус = Неопределено;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоМероприятиюОбучения(МероприятиеСсылка, СотрудникиСуммы = Неопределено)
	
	Если ТипЗнч(МероприятиеСсылка) <> Тип("СправочникСсылка.МероприятияОбученияРазвития") Тогда
		Возврат;
	КонецЕсли;

	СтоимостьМероприятия = Неопределено;
	СпособОпределенияСтоимости = Неопределено;
	
	Мероприятие = МероприятиеСсылка;
	Если ЗначениеЗаполнено(Мероприятие) Тогда
		ДанныеМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Мероприятие, "Стоимость, СпособОпределенияСтоимости");
		СтоимостьМероприятия = ДанныеМероприятия.Стоимость;
		СпособОпределенияСтоимости = ДанныеМероприятия.СпособОпределенияСтоимости;
	КонецЕсли;
	
	ЗаполнитьСуммуРасходов(СотрудникиСуммы);
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаявкеНаВключениеВПланОбучения(ЗаявкаСсылка)
	
	Если ТипЗнч(ЗаявкаСсылка) <> Тип("ДокументСсылка.ЗаявкаНаВключениеВПланОбучения") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаявкаОбъект = ЗаявкаСсылка.ПолучитьОбъект();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗаявкаОбъект, "Подразделение, ДатаНачала, ДатаОкончания, Комментарий");
	Сотрудники.Загрузить(ЗаявкаОбъект.Сотрудники.Выгрузить());
	Расходы.Загрузить(ЗаявкаОбъект.Расходы.Выгрузить());

	ЗаполнитьПоМероприятиюОбучения(ЗаявкаОбъект.Мероприятие);
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда // Заполнение по данным плана.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Подразделение, ДатаНачала, ДатаОкончания");
	
	Сотрудники.Очистить();
	Расходы.Очистить();
	
	Если ДанныеЗаполнения.Сотрудники = Неопределено Или ТипЗнч(ДанныеЗаполнения.Сотрудники) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Строка Из ДанныеЗаполнения.Сотрудники Цикл
		Для каждого СтрокаСоответствие Из Строка Цикл
			Сотрудники.Добавить()["Сотрудник"] = СтрокаСоответствие.Ключ;
		КонецЦикла;
	КонецЦикла;

	ЗаполнитьПоМероприятиюОбучения(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Мероприятие"),
								ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Сотрудники"));
	
КонецПроцедуры

Процедура ЗаполнитьСуммуРасходов(СотрудникиСуммы = Неопределено)
	
	Если СотрудникиСуммы <> Неопределено Тогда
		Для каждого ЭлементМассива Из СотрудникиСуммы Цикл
			Для каждого Соответствие Из ЭлементМассива Цикл
				СуммаОбученияНаОдного = ОбучениеРазвитиеКлиентСервер.СтоимостьМероприятия(
				СтоимостьМероприятия,СпособОпределенияСтоимости,1);
				Если Соответствие.Значение > СуммаОбученияНаОдного Тогда
					НоваяСтрока = Расходы.Добавить();
					НоваяСтрока.Сумма = Соответствие.Значение - СуммаОбученияНаОдного;
					НоваяСтрока.Примечание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Прочие расходы по %1'"),
					Строка(Соответствие.Ключ));
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли; 
	
	СуммаРасходов = ОбучениеРазвитиеКлиентСервер.СуммаРасходовНаОбучение(
		ОбучениеРазвитиеКлиентСервер.СтоимостьМероприятия(СтоимостьМероприятия, СпособОпределенияСтоимости, Сотрудники.Количество()), 
		Расходы);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
